# IsTransparent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..IsTransparent Property
TextNode Class See Also
---
Indicates whether the text background is transparent or opaque.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsTransparent { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsTransparent As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsTransparent {
	bool get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace